//Розробити клас String, який в подальшому будемо використовувати для роботи з рядками.Клас повинен містити :
//■ Конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
//■ Конструктор, що дозволяє створювати рядок довільного розміру;
//■ Конструктор, який створює рядок і ініціалізує його
//рядком, отриманим від користувача.
//Необхідно створити деструктор, а також використовувати механізми делегування конструкторів, якщо це
//можливо.
//Клас повинен містити методи для введення рядків з
//клавіатури і виведення рядків на екран.Також потрібно
//реалізувати статичну функцію - член, яка буде повертати
//кількість створених об’єктів рядків.

#include <iostream>
using namespace std;
#include "myString.h"

int main()
{
	// проверки без меню и т.д.
	myString str;
	char name[] = "Hello";
	myString str2 = name;
	str.input();
	str2.output();
	str.output();
	char* N = str.getStr();
	cout << "copy STR: " << N << endl;
	myString str3 = str;
	cout<<" OBJ: " << myString::getCoutObj();
	return 0;
}